app/controllers/libraries_controller.rb

SELECT "libraries".* FROM "libraries"
---
  def index
    @libraries = Library.all